In [3]:
import pandas as pd
import numpy as np
import xlrd

df = pd.read_excel("http://biostat.mc.vanderbilt.edu/wiki/pub/Main/DataSets/titanic3.xls")
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [5]:
df.survived.value_counts()

0    809
1    500
Name: survived, dtype: int64

In [13]:
df.groupby('sex')['survived'].value_counts().reset_index

<bound method Series.reset_index of sex     survived
female  1           339
        0           127
male    0           682
        1           161
Name: survived, dtype: int64>

In [11]:
df.sex.value_counts()

male      843
female    466
Name: sex, dtype: int64

In [14]:
df.pclass.value_counts()

3    709
1    323
2    277
Name: pclass, dtype: int64

In [18]:
df.groupby('pclass')['survived'].value_counts()

pclass  survived
1       1           200
        0           123
2       0           158
        1           119
3       0           528
        1           181
Name: survived, dtype: int64

In [32]:
data = df.drop(['survived','ticket','cabin','parch','fare','boat', 'home.dest','embarked', 'body', 'sex', 'pclass'], axis=1)
name=data.name

pandas.core.series.Series

In [66]:
name=name.str.strip()
name1=name.str.split(',', expand=True)
last_name=name1[0]
name2=name1[1].str.split('.', expand=True)
name2=name2.rename(columns={0:'title', 1: 'first_name'})
name2=name2.drop(2, axis='columns')
name2['last_name']=last_name
data=pd.concat([data, name2], axis=1)

24